In [2]:
sid = '1510700'
name = 'Nguyễn Thành Đạt'

In [6]:
import pandas as pd
import numpy as np
import matplotlib as plt
%matplotlib inline

In [7]:
train = pd.read_csv("train.csv")

train.shape

(891, 12)

In [8]:
test = pd.read_csv("test.csv")
dataset = (train,test)

In [9]:
# preprocess data
for ds in dataset:
    ds['Sex']= ds['Sex'].map({'female':0,'male':1}).astype(int)

In [10]:
#train['Age'] = train['Age'].fillna(train['Age'].mean())
for  ds in dataset:
    ds['Age'] = ds['Age'].fillna(ds['Age'].mean())
for ds in  dataset:
    ds.loc[ds["Age"] <= 9, "Age"] = 0
    ds.loc[(ds["Age"] > 9) & (ds["Age"] <= 19), "Age"] = 1
    ds.loc[(ds["Age"] > 19) & (ds["Age"] <= 29), "Age"] = 2
    ds.loc[(ds["Age"] > 29) & (ds["Age"] <= 39), "Age"] = 3
    ds.loc[(ds["Age"] > 29) & (ds["Age"] <= 39), "Age"] = 3
    ds.loc[ds["Age"] > 39, "Age"] = 4

In [11]:
for ds in dataset:
    ds['Cabin'] = ds['Cabin'].apply(lambda x:0 if type(x)== float else 1)
for  ds in dataset:
    ds['Embarked'] = ds['Embarked'].fillna('S')
for  ds in dataset:
    ds['SibSp'] =ds['SibSp'].fillna(0)
    
for  ds in dataset:
    ds['Embarked'] =ds['Embarked'].apply(lambda x: 0 if x=="S" else 1)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,2.0,1,0,A/5 21171,7.2500,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,3.0,1,0,PC 17599,71.2833,1,1
2,3,1,3,"Heikkinen, Miss. Laina",0,2.0,0,0,STON/O2. 3101282,7.9250,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,3.0,1,0,113803,53.1000,1,0
4,5,0,3,"Allen, Mr. William Henry",1,3.0,0,0,373450,8.0500,0,0

In [12]:
for ds in dataset:
    ds['Fare'] = ds['Fare'].fillna(train['Fare'].median())

for ds in dataset:
    ds.loc[ds["Fare"] <= 7.75, "Fare"] = 0
    ds.loc[(ds["Fare"] > 7.75) & (ds["Fare"] <= 7.91), "Fare"] = 1
    ds.loc[(ds["Fare"] > 7.91) & (ds["Fare"] <= 9.841), "Fare"] = 2
    ds.loc[(ds["Fare"] > 9.841) & (ds["Fare"] <= 14.454), "Fare"] = 3   
    ds.loc[(ds["Fare"] > 14.454) & (ds["Fare"] <= 24.479), "Fare"] = 4
    ds.loc[(ds["Fare"] >24.479) & (ds["Fare"] <= 31), "Fare"] = 5   
    ds.loc[(ds["Fare"] > 31) & (ds["Fare"] <= 69.487), "Fare"] = 6
    ds.loc[ds["Fare"] > 69.487, "Fare"] = 7   
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,2.0,1,0,A/5 21171,0.0,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,3.0,1,0,PC 17599,7.0,1,1
2,3,1,3,"Heikkinen, Miss. Laina",0,2.0,0,0,STON/O2. 3101282,2.0,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,3.0,1,0,113803,6.0,1,0
4,5,0,3,"Allen, Mr. William Henry",1,3.0,0,0,373450,2.0,0,0

In [13]:
for ds in dataset:
    ds = ds.drop(['Name', 'Ticket','PassengerId'],axis = 1)
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,2.0,1,0,A/5 21171,0.0,0,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,3.0,1,0,PC 17599,7.0,1,1
2,3,1,3,"Heikkinen, Miss. Laina",0,2.0,0,0,STON/O2. 3101282,2.0,0,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,3.0,1,0,113803,6.0,1,0
4,5,0,3,"Allen, Mr. William Henry",1,3.0,0,0,373450,2.0,0,0

In [14]:
X_train = train.drop(['Name', 'Ticket','PassengerId','Survived'],axis = 1)
Y_train = train['Survived']
#X_test = test.drop(['Name','Ticket','PassengerId','Survived'],axis=1)

In [15]:
X_train.head()

   Pclass  Sex  Age  SibSp  Parch  Fare  Cabin  Embarked
0       3    1  2.0      1      0   0.0      0         0
1       1    0  3.0      1      0   7.0      1         1
2       3    0  2.0      0      0   2.0      0         0
3       1    0  3.0      1      0   6.0      1         0
4       3    1  3.0      0      0   2.0      0         0

In [16]:
Y_train.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [19]:
X_test.head()

NameError: name 'X_test' is not defined

In [18]:
from sklearn.tree import DecisionTreeClassifier
classifier = DecisionTreeClassifier()
classifier.fit(X_train, Y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [165]:
y_pred = classifier.predict(X_test)

### Predict passenger Result:

In [166]:

print(classification_report(y_test,y_pred))

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 1, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0,
       0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1,
       0, 0, 1, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1,
       1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1,
       0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0,
       1, 0, 0, 1])

In [4]:
y_test = pd.read_csv('gender_submission.csv')
y_test.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [5]:
y_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
PassengerId    418 non-null int64
Survived       418 non-null int64
dtypes: int64(2)
memory usage: 6.6 KB